[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:141:15
    */
   updatePlayerLocation(player: Player, location: UserLocation): void {
     const conversation = this.conversationAreas.find(
-      conv => conv.label === location.conversationLabel,
+      conv => true,
     );
     const prevConversation = player.activeConversationArea;
killedBy: CoveyTownController updatePlayerLocation if the previous and current conversation area are not equal, a change should be made
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
hw3-handout/src/lib/CoveyTownController.ts:172:49
    */
   removePlayerFromConversationArea(player: Player, conversation: ServerConversationArea): void {
     conversation.occupantsByID.splice(
-      conversation.occupantsByID.findIndex(p => p === player.id),
+      conversation.occupantsByID.findIndex(p => true),
       1,
     );
killedBy: CoveyTownController removePlayerFromCA trying to remove player taht isnt in the CA should result in no change.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "HFLx43Z0asPt5BPyPeI7c",
+   "74jGZsKCer3NMWedhpfyG",

[Killed] ArrowFunction
hw3-handout/src/lib/CoveyTownController.ts:202:9
   addConversationArea(_conversationArea: ServerConversationArea): boolean {
     if (
       this._conversationAreas.find(
-        eachExistingConversation => eachExistingConversation.label === _conversationArea.label,
+        () => undefined,
       )
     )
killedBy: CoveyTownController addConversationArea should not add conversation area if they have the same label
statusReason: Error: expect(received).toBeFalsy()

Received: true
